================================
Declarations of variables
================================

a = 3

---

(source_file
  (expression (identifier) (number))
)

========================================
Declarations of variables with semicolon
========================================

a = 3;

---

(source_file
  (expression (identifier) (number))
)

========================================
Declarations of variables with operation
========================================

a = 3 == a;

---

(source_file
  (expression (identifier) (operation (number) (identifier)))
)

========================================
Declarations of variables as computation
========================================

a = 3 * f;

---

(source_file
  (expression (identifier) (operation (number) (identifier)))
)

===================
Vector declarations
===================

a = [1 2 3;1, 2, 3];

---

(source_file
  (expression (identifier) (vector_definition (number) (number) (number) (number) (number) (number)))
)

===================
Rotated vector declarations
===================

a = [1 2 3;1, 2, 3]';

---

(source_file
  (expression (identifier) (vector_definition (number) (number) (number) (number) (number) (number)))
)

==================
Vector as variable
==================

[t, k] = func();

---

(source_file
  (expression (vector_definition (identifier) (identifier)) (function_call (identifier) (argument_list)))
)

==============
Declare string
==============

a = '';
a = 'c';
b = 'a ''b'' c' 

---
(source_file
  (expression (identifier) (string))
  (expression (identifier) (string))
  (expression (identifier) (string)))

==============
Declare char vector
==============

a = ['b', 'c'];

---
(source_file
  (expression (identifier) (vector_definition (string) (string))))
